<?php
// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------

return [
    // 模板引擎
    'type'         => 'Php',
    // 默认模板渲染规则
    'auto_rule'    => 1,
    // 模板目录名
    'view_dir_name' => 'view',
    // 模板后缀
    'view_suffix'  => 'html',
    // 模板文件名分隔符
    'view_depr'    => DIRECTORY_SEPARATOR,
    // 模板缓存设置（开发模式关闭缓存）
    'tpl_cache'    => false,
    // 允许PHP代码
    'tpl_deny_php' => false,
];
